const state = {
    currentPage: 'home',
    currentQuestion: 0,
    answers: [],
    questions: [
        { 
            question: "Ваш пол:", 
            options: ["Мужчина", "Женщина"] 
        },
        { 
            question: "Укажите ваш возраст:", 
            options: ["До 18", "от 18 до 28", "От 29 до 35", "От 36"] 
        },
        { 
            question: "Выберите лишнее:", 
            options: ["Дом", "Шалаш", "Бунгало", "Скамейка", "Хиджина"] 
        },
        { 
            question: "Продолжите числовой ряд: 18 20 24 32", 
            options: ["62", "48", "74", "57", "60", "77"] 
        },
        { 
            question: "Выберите цвет, который сейчас наиболее вам приятен:", 
            options: ["grey", "blue", "green", "red", "yellow", "brown", "black", "violet", "turquoise"] 
        },
        { 
            question: "Отдохните пару секунд, еще раз выберите цвет, который сейчас наиболее вам приятен:", 
            options: ["grey", "turquoise", "brown", "green", "black", "red", "violet", "yellow", "blue"] 
        },
        { 
            question: "Какой из городов лишний?", 
            options: ["Вашингтон", "Лондон", "Париж", "Нью-Йорк", "Москва", "Оттава"] 
        },
        { 
            question: "Выберите правильную фигуру из четырёх пронумерованных.", 
            image: 'assets/figures.png',
            options: ["1", "2", "3", "4"] 
        },
        { 
            question: "Вам привычнее и важнее:", 
            options: ["Наслаждатья каждой минутой проведенного времени", "Быть устремленными мыслями в будущее", "Учитывать в ежедневной практике прошлый опыт"] 
        },
        { 
            question: "Какое определение, по-Вашему, больше подходит к этому геометрическому изображению:",
            image: 'assets/pyramid.png', 
            options: ["Оно остроконечное", "Оно устойчиво", "Оно-находится в состоянии равновесия"] 
        },
        {
            question: "Вставьте подходящее число",
            image: 'assets/star.png',
            options: ["34", "36", "53", "44", "66", "42"]
        }
    ],
    apiData: null
};